In [1]:
import pandas as pd
from xgboost import XGBRegressor

In [2]:
train = pd.read_csv('/content/training.csv',';')
valid = pd.read_csv('/content/validation.csv',';')
y_train = train.classLabel
X = list(train.columns)
X.remove('classLabel')
X_train = train[X]

In [3]:
y_valid = valid.classLabel
X_valid = valid[X]

In [4]:
X_train.head()

  variable1 variable2  variable3  ... variable17 variable18 variable19
0         a     17,92    5,4e-05  ...   800000.0          t          0
1         b     16,92   3,35e-05  ...  2000000.0        NaN          0
2         b     31,25  0,0001125  ...   960000.0          t          0
3         a     48,17  0,0001335  ...        0.0        NaN          0
4         b     32,33    0,00035  ...  2320000.0          f          0

[5 rows x 18 columns]

In [5]:
X_valid.head()

  variable1 variable2  variable3  ... variable17 variable18 variable19
0         b     32,33    0,00075  ...  4200000.0        NaN          1
1         b     23,58   0,000179  ...  1360000.0        NaN          0
2         b     36,42    7,5e-05  ...  2400000.0        NaN          1
3         b     18,42  0,0010415  ...  1200000.0        NaN          0
4         b      24,5  0,0013335  ...  1200000.0          f          1

[5 rows x 18 columns]

In [6]:
# Get list of categorical variables
s = (X_train.dtypes == 'object')
object_cols = list(s[s].index)

print("Categorical variables:")
print(object_cols)

Categorical variables:
['variable1', 'variable2', 'variable3', 'variable4', 'variable5', 'variable6', 'variable7', 'variable8', 'variable9', 'variable10', 'variable12', 'variable13', 'variable18']

The columns variable2, variable3, variable8 needs to be modified to be in it's numerical value so we would encode the categorical columns.

i was going to go basic and use random forrest,XGBoost and naive baissan as it's a binary classification problem with cross-validation 
and compare the results.